Revit 2027 API
StructuralConnectionHandler.SingleElementEndIndex Property
 Element end index for single element connections (0: start, 1: end).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SingleElementEndIndex { get; set; }
Public Property SingleElementEndIndex As Integer
	Get
	Set
public:
property int SingleElementEndIndex {
	int get ();
	void set (int value);
}
member SingleElementEndIndex : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: singleElementEndIndex is not a valid end index.
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace